unagauchada/app/controllers/buys_controller.rb

SELECT  `cards`.* FROM `cards` WHERE `cards`.`numero` = 324431 LIMIT 1
INSERT INTO `buys` (`cantidad`, `precio_total`, `precio_actual`, `created_at`, `updated_at`, `user_id`, `numero_de_tarjeta`) VALUES (2, 100.0, 50.0, '2017-06-06 18:07:59', '2017-06-06 18:07:59', 1, 111)
UPDATE `users` SET `creditos` = 2, `updated_at` = '2017-06-06 18:07:59' WHERE `users`.`id` = 1
---
  def create
    @buy = Buy.new(buy_params)
    @tarjetas= Card.all
    @numero= @buy.numero_de_tarjeta
    #@tarjeta=@tarjetas.first
    @tarjeta = @tarjetas.find_by(numero: @numero)
    @precio_total= @buy.cantidad * 50
    unless @tarjeta.nil?
      if @tarjeta.credito >= @precio_total
            @buy.precio_actual=50
            @buy.precio_total=@precio_total
            @tarjeta.credito= @tarjeta.credito - @precio_total

            @buy.user_id=current_user.id
            current_user.creditos=current_user.creditos + @buy.cantidad

            respond_to do |format|
              if @buy.save and current_user.save and @tarjeta.save

SELECT  `buys`.* FROM `buys` WHERE `buys`.`id` = 7 LIMIT 1
---
    def set_buy
      @buy = Buy.find(params[:id])