unagauchada/app/controllers/gauchadas_controller.rb

SELECT `gauchadas`.* FROM `gauchadas` WHERE (title LIKE '%ssss%') ORDER BY cant_postulantes ASC
---
  def index
    @busqueda=params[:searchbox]
    @selecion=params[:selecion]
    @order=params[:opcion]
    @opcion="#{@selecion} #{params[:opcion]}"


    if @busqueda and @selecion
      @gauchadas= Gauchada.search(@busqueda).order(@opcion)

INSERT INTO `gauchadas` (`title`, `descripcion`, `fecha_de_inicio`, `fecha_limite`, `created_at`, `updated_at`, `user_id`, `cover_file_name`, `cover_content_type`, `cover_file_size`, `cover_updated_at`, `ciudad`) VALUES ('sfdf', 'fdfdf', '2017-06-06', '2017-06-06', '2017-06-06 21:35:39', '2017-06-06 21:35:39', 5, 'e4e149d87b4f8f5330c1e3c79c24ea6f.jpg', 'image/jpeg', 57214, '2017-06-06 21:35:38', 'dffd')
---
  def create
    if current_user.creditos >= 1
      @gauchada = current_user.gauchadas.new(gauchada_params)

      respond_to do |format|
        if @gauchada.save

SELECT  `gauchadas`.* FROM `gauchadas` WHERE `gauchadas`.`id` = 3 LIMIT 1
---
    def set_gauchada
      @gauchada = Gauchada.find(params[:id])