unagauchada/app/controllers/index_controller.rb

SELECT `gauchadas`.* FROM `gauchadas`
---
  def index
  	@gauchadas = Gauchada.all