unagauchada/app/controllers/postularse_controller.rb

SELECT  `gauchadas`.* FROM `gauchadas` WHERE `gauchadas`.`id` = 3 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `gauchadas` SET `cant_postulantes` = 1, `updated_at` = '2017-06-06 21:45:51' WHERE `gauchadas`.`id` = 3
INSERT INTO `postularses` (`created_at`, `updated_at`, `user_id`, `gauchada_id`, `descripcion`) VALUES ('2017-06-06 21:45:51', '2017-06-06 21:45:51', 5, 3, 'dgdgdg')
---
  def create

	@postularse = Postularse.new(postularse_params)
	@postularse.user_id= current_user.id
    @gauchada=Gauchada.find(@postularse.gauchada_id)
    @gauchada.cant_postulantes= @gauchada.cant_postulantes + 1
    @gauchada.save
    @postularse.save